app/Controllers/Regime.php

   public function objectif(){
    $objectifId = (int) $this->request->getGet('objectif');
    $userId = (int) $this->session->get('user_id');

    if (!$userId) {
        return redirect()->to('/');
    }

    $this->session->set('objectif', $objectifId);

    $profile = $this->healthProfileModel->getLatestForUser($userId);
    $user = $this->userModel->find($userId);
    $objectif = $this->objectifTypeModel->find($objectifId);

    if (!$profile || !$user || !$objectif) {
        return view('regime', ['regimes' => []]);
    }

    $genre = $this->genreModel->find((int) $user['id_genre']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 2
SELECT *
FROM `genres`
WHERE `genres`.`id` = 1