app/Controllers/Regime.php

SELECT *
FROM `users`
WHERE `users`.`id` = 1
SELECT *
FROM `genres`
WHERE `genres`.`id` = 1
---
    private function buildSuggestionContext(int $userId): array
    {
        $objectifUser = $this->userObjectifModel->getByUserId($userId);
        $objectifId = $objectifUser ? (int) $objectifUser['id_objectif_type'] : (int) $this->session->get('objectif');

        $objectifLabel = '';
        if ($objectifId > 0) {
            $objectif = $this->objectifTypeModel->find($objectifId);
            if ($objectif && isset($objectif['libelle'])) {
                $objectifLabel = (string) $objectif['libelle'];
            }
        }

        $profile = $this->healthProfileModel->getLatestForUser($userId);
        $poidsActuel = $profile && isset($profile['poids_actuel']) ? (float) $profile['poids_actuel'] : null;
        $poidsCible = $objectifUser && isset($objectifUser['poids_cible']) ? (float) $objectifUser['poids_cible'] : null;

        $maintenance = 0.0;
        if ($profile && isset($profile['poids_actuel'], $profile['taille'])) {
            $user = $this->userModel->find($userId);
            $genreLabel = 'Femme';
            if ($user && isset($user['id_genre'])) {
                $genre = $this->genreModel->find((int) $user['id_genre']);

SELECT *
FROM `users`
WHERE `users`.`id` = 1
SELECT *
FROM `genres`
WHERE `genres`.`id` = 1
---
    private function buildSuggestedRegimesData(int $userId): array
    {
        $context = $this->buildSuggestionContext($userId);
        $user = $this->userModel->find($userId);
        $profile = $this->healthProfileModel->getLatestForUser($userId);
        $objectiveData = $this->userObjectifModel->getByUserId($userId);
        $boughtRegimeIds = $this->achatRegimeModel->getRegimeIdsByUser($userId);

        $objective = $context['objectifId'] > 0 ? $this->objectifTypeModel->find($context['objectifId']) : null;

        $genreLabel = 'Femme';
        if ($user && isset($user['id_genre'])) {
            $genre = $this->genreModel->find((int) $user['id_genre']);