app/Models/ActiviteModel.php

SELECT `activites_sportives`.`nom` AS `name`, `regime_activites`.`duree_minutes_jour` AS `duree_minutes_jour`
FROM `activites_sportives`
JOIN `regime_activites` ON `regime_activites`.`activite_id` = `activites_sportives`.`id`
WHERE `regime_activites`.`regime_id` = 1
---
    public function getByRegimeId(int $regimeId): array
    {
        return $this->select('activites_sportives.nom AS name, regime_activites.duree_minutes_jour AS duree_minutes_jour')
            ->join('regime_activites', 'regime_activites.activite_id = activites_sportives.id')
            ->where('regime_activites.regime_id', $regimeId)
            ->findAll();