app/Models/CategorieModel.php

    public function getAll()
    {
        return $this->findAll();
---
SELECT *
FROM `categorie`