app/Models/RegimeModel.php

SELECT *
FROM `regime`
WHERE `categorie_id` = '3'
SELECT *
FROM `regimes`
WHERE `regimes`.`id` = '7'
---
    public function getAll($categorieId = null)
    {
        $builder = $this->select('regime.*, (duree_jours * prix_journalier) AS prix_total');

        if ($categorieId !== null) {
            return $builder->where('categorie_id', $categorieId)->findAll();
        }

        return $builder->findAll();