app/Models/RegimeModel.php

        // Fallback: if no regimes found (e.g. no regime_details or activites defined),
        // return regimes that match the objectif_type_id when provided.
        if ((empty($results) || count($results) === 0) && $objectifTypeId !== null && $objectifTypeId > 0) {
            return $this->where('objectif_type_id', $objectifTypeId)->findAll();
---
SELECT *
FROM `regimes`
WHERE `objectif_type_id` = 1