app/Models/UserHealthProfileModel.php

SELECT *
FROM `user_health_profiles`
WHERE `user_id` = 1
ORDER BY `date_mesure` DESC
 LIMIT 1
---
    public function getLatestForUser(int $userId): ?array
    {
        return $this->where('user_id', $userId)
            ->orderBy('date_mesure', 'desc')
            ->first();

INSERT INTO `user_health_profiles` (`user_id`, `poids_actuel`, `taille`) VALUES (2, 80, 170)
---
    public function createProfile(int $userId, float $poidsActuel, float $taille): bool
    {
        return (bool) $this->insert([
            'user_id' => $userId,
            'poids_actuel' => $poidsActuel,
            'taille' => $taille,
        ]);