app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'test@gmail.com'
 LIMIT 1
---
    public function authenticateCredentials(string $email, string $motDePasse): ?array
    {
        $user = $this->where('email', $email)->first();

SELECT *
FROM `users`
WHERE `email` = 'bota@gmail.com'
 LIMIT 1
---
    public function registerUser(string $nom, string $email, string $motDePasse, string $genre, string $telephone, int $taille, int $poids): ?array
    {
        $saved = $this->save([
            'username' => $nom,
            'email' => $email,
            'password' => password_hash($motDePasse, PASSWORD_DEFAULT),
            'genre' => $genre,
            'telephone' => $telephone,
            'taille' => $taille,
            'poids' => $poids,
            'created_at' => date('Y-m-d H:i:s'),

        ]);

        if (!$saved) {
            return null;
        }

        return $this->where('email', $email)->first();