app/Models/UserObjectifModel.php

SELECT *
FROM `user_objectifs`
WHERE `user_id` = 1
 LIMIT 1
---
    public function getByUserId(int $userId): ?array
    {
        return $this->where('user_id', $userId)->first();

INSERT INTO `user_objectifs` (`user_id`, `id_objectif_type`, `poids_cible`) VALUES (2, 2, 70)
---
    public function setObjective(int $userId, int $objectifTypeId, float $poidsCible): bool
    {
        $existing = $this->getByUserId($userId);
        $data = [
            'user_id' => $userId,
            'id_objectif_type' => $objectifTypeId,
            'poids_cible' => $poidsCible,
        ];

        if ($existing) {
            return (bool) $this->update($existing['id'], $data);
        }

        return (bool) $this->insert($data);